# ZeroLengthSegmentWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..ZeroLengthSegmentWarning Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The solution is failing to do segments which are zero length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ZeroLengthSegmentWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZeroLengthSegmentWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ZeroLengthSegmentWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace